{
  "title": "Alex Bezuska",
  "subtitle": "UX Engineer, Front-End Developer, and Game Designer",
  "description": "Game artist and developer at independent games studio Two Scoop Games. Serves on the board of 501(c)3 non-profit Louisville Makes Games! a community of game creators. Lover of ice cream.",
  "google-analytics-id": "UA-16421229-1",
  "pages":[
    {
      "name": "Resume",
      "file": "index.html",
      "showInNav": true
    },
    {
      "name": "Portfolio",
      "file": "portfolio.html",
      "showInNav": false
    },
    {
      "name": "Contact",
      "file": "contact.html",
      "showInNav": true
    }
  ],
  "about": {
    "name": "Alex Bezuska",
    "email": "alex@twoscoopgames.com",
    "phone": "(502) 715-2710",
    "greeting": "Hi there!",
    "hello": "I'm Alex Bezuska, a UX Engineer, Front-End Developer, and Game Designer. Nice to meet you!",
    "hello-extended":
    [
      "10+ years front-end web development experience, creating and refining beautiful, functional, and most importantly <em>usable</em> interfaces.",
      "Excellent communication skills especially in connecting and translating between developers and non-technical staff.",
      "25+ years of Adobe Software experience including Photoshop, Illustrator, and more.",
      "Comfortable with Mac, Windows, and Linux - including command line.",
      "8+ years Git version control experience.",
      "Based in the Louisville, Kentucky area."
    ],
    "cover-letter":{
      "title":"Intention",
      "body":[
        "I am seeking a remote position as a Senior Software Engineer - UI/UX Designer",
        "I have nearly a decade of experience working on teams where I helped to translate ideas from product owners and marketing to developers to create functional and user-friendly designs. I am well versed in frontend technologies including JavaScript, CSS (Sass and Less preprocessors), Bootstrap, build tools, Node, NPM, and Git. I have some experience with React / React Native, Angular as well and can learn and adapt quickly.",
        "My main skills are my ability to communicate ideas and concepts with anyone on the team regardless of technical knowledge while creating products that have the user in mind first and fortemost.",
        "Please feel free to take a look at my relevant work experience and let's setup a call if you want to learn more about what I can do for you."
      ]
    },

    "img": {
      "url":"/img/site/alex_bezuska_2022.png",
      "alt": "About Game Artist and Devloper Alex Bezuska"
    }
  }
}
