{
    "title": "Alex Bezuska",
    "subtitle": "UX Engineer and Front-End Developer",
    "description": "10+ years front-end web development experience, creating and refining beautiful, functional, and most importantly, user-friendly interfaces",
    "google-analytics-id": "UA-16421229-1",
    "about": {
      "name": "Alex Bezuska",
      "email": "abezuska@gmail.com",
      "phone": "(502) 715-2710",
      "greeting": "Hi there!",
      "hello": "I'm Alex Bezuska, a UX Engineer and Front-End Developer, nice to meet you!",
      "img": {
        "url": "/img/alex_bezuska_2022.png",
        "alt": "UX Engineer and Front-End Developer Alex Bezuska"
      },
      "extended": [
        "Front-end web development experience.",
        "Excellent communication skills especially in connecting and translating between developers and non-technical staff.",
        "Adobe Software experience.",
        "Comfortable with Mac, Windows, and Linux - including command line.",
        "Git version control experience.",
        "Based in the Louisville, Kentucky area."
      ],
      "cover-letter": {
        "title": "Intention",
        
          "body": [
            ""
          ]
        }
        
    },

"skills": {
  "skills-category-0": {
    "title": "UX & Design",
    "icon": "icons/ux.svg",
    "skills": [
      "Design Systems & Component Libraries (React Storybook)",
      "Wireframing & Prototyping (Figma, Balsamiq)",
      "B2B SaaS & Enterprise UX",
      "Translating Requirements for Technical & Non-Technical Audiences"
    ]
  },
  "skills-category-1": {
    "title": "Front-End Development",
    "icon": "icons/frontend.svg",

    "skills": [
      "HTML, CSS, Sass/Less, Bootstrap, JavaScript",
      "Git (command line)",
      "Cross-functional Team Collaboration",
      "Scoping & Solution Architecture"
    ]
  },
  "skills-category-2": {
    "title": "Systems & Automation",
    "icon": "icons/automation.svg",
    "skills": [
      "Command Line (macOS, Linux, Bash)",
      "Shell Scripting for Filesystem Tasks",
      "Basic Web Server Administration (Apache, NGINX, domains, SSL)",
      "AI-Assisted Productivity (ChatGPT for summarization, scripting, OCR, and repetitive code generation)"
    ]
  },
  "skills-category-3": {
    "title": "Creative Tools & Game Dev",
    "icon": "icons/game.svg",
    "skills": [
      "Adobe CC (Photoshop, Illustrator, Animate, Premiere Pro, After Effects)",
      "2D Animation (Spine, Lottie, Unity Rigging)",
      "Unity (PC, Mobile, AR/VR) – Full-stack: gameplay, systems, art, animation, sound"
    ]
  }
},



    "work": [
      {
        "title": "UX/UI Design, Development, and Project Management",
        "url": "http://alexbezuska.com",
        "company": "Self-employed – Contract Work for Various Companies",
        "location": "Louisville, KY area",
        "from": "January 2018",
        "to": "present",
        "description": "I’ve worked with a variety of clients — like Blackstone Media, Amundsen Tech, ScholarRX, and Horse Racing Nation — helping them build everything from web apps to mobile tools to interactive content. I’ve handled UX design, front-end development, and project management, often jumping between roles to keep the process moving. Most projects were B2B and focused on making complex stuff easier to use. I’ve teamed up with developers, clients, and users to make sure the final product looked good and worked even better.",
        "show": true
      },
      {
        "title": "Senior UX Engineer",
        "company": "El Toro",
        "location": "Louisville, KY (full-remote)",
        "from": "July 2023",
        "to": "January 2025",
        "description": "At El Toro, I led the design and rollout of the company’s first design system using React Storybook, supporting both internal tools and public-facing products. I worked closely with engineers, stakeholders, and leadership to turn complex requirements into clear, usable interfaces. Along the way, I ran usability testing, helped prioritize design work, and built scalable UX patterns that sped up development and kept things consistent across teams.",
        "show": true
      },
      {
        "title": "UX/UI Designer",
        "url": "https://atriaseniorliving.com",
        "company": "Atria",
        "location": "Louisville, KY (full-remote)",
        "from": "January 2021",
        "to": "October 2022",
        "description": "At Atria, I helped put together a consistent design system for a many SaaS web and mobile tools used by staff and residents across the country. I worked with teams across different departments to clean up the user experience and make sure everything felt cohesive. A big part of the job was keeping things on track between the Louisville team and developers overseas — making sure everyone was on the same page. I focused on building clean, accessible UI components and keeping communication flowing smoothly between design and engineering.",
        "show": true
      },
      {
        "title": "UX Engineer",
        "company": "Platform Q",
        "location": "Boston, MA (full-remote)",
        "from": "December 2015",
        "to": "January 2018",
        "description": "At Platform Q, I worked remotely with two cross-functional teams to bring wireframes and prototypes to life on a large-scale video learning platform. I focused on turning complex requirements into intuitive, polished user experiences that served thousands of learners. My role blended design and front-end implementation, and I stayed in close daily communication with developers and stakeholders to make sure the user experience stayed front and center. I also contributed to design system improvements and helped refine the handoff between design and development.",
        "show": true
      },
      {
        "title": "Web Developer",
        "company": "cafepress",
        "location": "Louisville, KY (hybrid-remote)",
        "from": "May 2014",
        "to": "December 2015",
        "description": "I started on a small R&D-style team at CafePress building out new product ideas and the user-facing experiences that brought them to life. Later, I joined the main front-end team, where I worked on high-traffic pages seen by tens of thousands of users daily. I focused on delivering clean, user-friendly interfaces and collaborated closely with designers, marketers, and backend developers to keep projects running smoothly across teams.",
        "show": true
      },
      {
        "title": "Front End Web Developer",
        "company": "Mortenson Dental Partners",
        "location": "Louisville, KY",
        "from": "April 2013",
        "to": "May 2014",
        "description": "At Mortenson, I designed and built internal tools and public-facing websites with a strong focus on usability and clear, accessible UI. I took the lead on UX decisions across projects, acting as the go-to advocate for user needs. I also introduced more modern front-end practices to the team, helping bring in industry standards and streamline development workflows. I worked closely with internal stakeholders and developers to ensure the tools we delivered made everyday tasks easier and more efficient for staff.",
        "show": false
      },
      {
        "title": "Independent Web Designer",
        "company": "AlexBezuska.com",
        "from": "January 2008",
        "to": "April 2013",
        "description": "I worked one-on-one with small business clients to design and build custom websites that reflected their brand and vision. I focused on balancing user experience with each client’s unique goals, often creating animated, visually engaging sites that helped them stand out and make a strong first impression online. Many of these businesses were launching their digital presence for the first time, and I guided them through that process from concept to launch.",
        "show": false
      }
    ],
    "hobbies": [],
    "community": [
      {
        "title": "Co-Founder/Director/President",
        "url": "http://louisvillemakesgames.org",
        "company": "Louisville Makes Games",
        "from": "August 2015",
        "to": "Present",
        "description": "In 2015 I co-founded a 501-(c)(3) non-profit organization called Louisville Makes Games, Inc. The goal of LMG is to provide educational courses and promote game development careers in the city of Louisville, KY. In February 2016, we had the grand opening for Warp Zone Louisville, the first and only game development-centric co-working space in Louisville (and Kentucky!). Community meetups, classes, and events are hosted out of Warp Zone Louisville, as well as providing amenities of a co-working space on Main Street in downtown Louisville."
      },
      {
        "title": "Co - Founder / Organizer / Host ",
        "url": "https://www.meetup.com/LouisvilleMakesGames/",
        "company": "Lousville Game Creator's Meetup",
        "from": "February 2014",
        "to": "Present",
        "description": "The independent game developer community in Louisville is a huge passion of mine. The Louisville Game Creator's Meetup (formerly Game Dev Lou) is a twice-monthly meetup and support group for local game developers. I have facilitated nearly every meeting, and to date I have helped to organize 3-4 game jam events per year."
      },
      {
        "title": "Founder / Organizer / Host ",
        "url": "http://jslou.org",
        "company": "JSLou - Louisville's JavaScript Community",
        "from": "August 2013",
        "to": "June 2018",
        "description": "In order to grow and challenge myself as a developer, I founded and hosted JSLou; a local group focused on all things JavaScript. I learned a great deal from the many experienced developers I met through JSLou. I enjoyed facilitating an environment where others can learn and expand their skills. After maintaining the group for nearly five years I passed the torch to new passionate developers to continue facilitating the community."
      }
    ],
    "speaking": [
      {
        "title": "How to Get Started Making Video Games at the Louisville Public Library 2023",
        "description": "I presented at the Bon Air Library in Louisville, Kentucky, representing Louisville Makes Games, discussing how to get started making video games. The event sparked curiosity and passion among enthusiastic teens and parents, highlighting the collaborative nature of game development and the diverse array of skills required."
      },
      {
        "title": "Code Louisville / Code Kentucky Talk 2022",
        "description": "I spoke to a large group over video about the job market in Louisville for entry level web and software developers, gave advice on how to find your first job in tech, and spoke about my experience working on games."
      },
      {
        "title": "Code PaLOUsa",
        "description": "In 2020 I spoke on a panel hosted by Code Louisville as part of the Code PaLOUsa virtual conference, where I spoke about my experience as a self-taught web developer. I also had the privilege of running workshops on 3 separate occasions (2015, 2016, and 2018) where I taught participants to create games using Unity, and HTML5 / JavaScript."
      }
    ],
    "teaching": [
      {
        "title": "Louisville Makes Games Video Tutorials",
        "description": "In 2020, due to the pandemic, I helped facilitate a new direction for Louisville Makes Games' education program – providing free online video tutorial content."
      },
      {
        "title": "Louisville Makes Games Summer Classes",
        "description": "In 2017 I had a major role in the development and teaching of a free 6-week summer program at Warp Zone Louisville to give kids a taste of the many disciplines of game development including: coding, story, art & animation, music & sound, and game design."
      },
      {
        "title": "Velocity Kids",
        "description": "In 2014 I taught a monthly game development workshop at Velocity Indiana for youth ages 11 - 18 as part of their code education program."
      }
    ],
    "advocating": [
      {
        "title": "Louisville Makes Games",
        "description": "In summer 2015 I helped to found the 501(c)(3) non-profit Louisville Makes Games, Inc. As a director of LMG, I strive to continue the momentum of Louisville's growing game development community and provide inclusive, encouraging, and beginner-friendly events."
      },
      {
        "title": "JSLou",
        "description": "I founded and hosted Louisville's JavaScript Group JSLou with 2 regular meetings each month for almost five years."
      }
    ]
  }