[
    {
        "title": "Co-Founder/Director/President",
        "url": "http://louisvillemakesgames.org",
        "company": "Louisville Makes Games",
        "from": "August 2015",
        "to": "Present",
        "description": "In 2015 I co-founded a 501-(c)(3) non-profit organization called Louisville Makes Games, Inc. The goal of LMG is to provide educational courses and promote game development careers in the city of Louisville, KY. In February 2016, we had the grand opening for Warp Zone Louisville, the first and only game development-centric co-working space in Louisville (and Kentucky!). Community meetups, classes, and events are hosted out of Warp Zone Louisville, as well as providing amenities of a co-working space on Main Street in downtown Louisville."
    },
    {
        "title": "Co - Founder / Organizer / Host ",
        "url": "https://www.meetup.com/LouisvilleMakesGames/",
        "company": "Lousville Game Creator's Meetup",
        "from": "February 2014",
        "to": "Present",
        "description": "The independent game developer community in Louisville is a huge passion of mine. The Louisville Game Creator's Meetup (formerly Game Dev Lou) is a twice-monthly meetup and support group for local game developers. I have facilitated nearly every meeting, and to date I have helped to organize 3-4 game jam events per year."
    },
    {
        "title": "Founder / Organizer / Host ",
        "url": "http://jslou.org",
        "company": "JSLou - Louisville's JavaScript Community",
        "from": "August 2013",
        "to": "June 2018",
        "description": "In order to grow and challenge myself as a developer, I founded and hosted JSLou; a local group focused on all things JavaScript. I learned a great deal from the many experienced developers I met through JSLou. I enjoyed facilitating an environment where others can learn and expand their skills. After maintaining the group for nearly five years I passed the torch to new passionate developers to continue facilitating the community."
    }
]