[
  {
    "job": "Warp Zone Louisville",
    "job-url": "http://warpzonelouisville.com",
    "title": "Co-founder/Member",
    "date-start": "Janurary 2016",
    "date-end": "Present",
    "description": [
      "As the first and currently only game dev space in Kentucky, Warp Zone Louisville is fostering the growth and formation of both small independant studios and individual game creators by providing a space to meet, work, and collaborate on games and interactive art."
    ],
    "show": true
  },
  {
    "job": "Louisville Makes Games, Inc.",
    "job-url": "http://louisvillemakesgames.org",
    "title": "Co-founder/President",
    "date-start": "July 2015",
    "date-end": "Present",
    "description": [
      " I founded a non-profit organization called Louisville Makes Games, Inc. along with other local game developers in 2015. The goal of LMG is to provide educational courses and advocate for game development careers in the city of Louisville, KY."
    ],
    "show": true
  },
  {
    "job": "Louisville Game Creator's Meetup",
    "job-url": "http://louisvillemakesgames.org",
    "title": "Co-founder/Organizer/Host",
    "date-start": "February 2014",
    "date-end": "Present",
    "description": [
      "The independent game developer community in Louisville is a huge passion of mine. Louisville Game Creators Meetup (formerly Game Dev Lou) is a twice-monthly meetup and support group for local artists, animators, storytellers, musicians, and programmers. I have facilitated nearly every meeting, and I have helped to organize 3-5 game jam events per year. "
    ],
    "show": true
  },
  {
    "job": "JSLou",
    "job-url": "http://jslou.org",
    "title": "Founder/Organizer/Host",
    "date-start": "August 2013",
    "date-end": "Present",
    "description": [
      "In order to grow and challenge myself as a developer I have started and sustained JSLou, a local group focused on all things JavaScript. I have learned a great deal from the many experienced developers I have met through JSLou. I enjoy facilitating an environment where others can learn and expand their skills."
    ],
    "show": true
  }

]
